In [26]:
import pandas as pd
import csv
import re
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\elías\appdata\local\programs\python\python313\lib\site-packages (2.0.2)

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [27]:
# 2) Rutas a los ficheros 

RUTA_BASE = r"C:/Users/Elías/Desktop/Bootcamp/Proyectos/Week 4"
RUTA_CENSO   = rf"{RUTA_BASE}/Censo.xls"
RUTA_COSTE  = rf"{RUTA_BASE}/Coste_vivienda.xls" 


# 3) Cargar excel

df_censo = pd.read_excel(RUTA_CENSO, engine="xlrd")          
df_coste_vivienda = pd.read_excel(RUTA_COSTE, engine="xlrd")

In [28]:
df_censo.head()

,Comunidad,2003,2004,2005,2006,2007,2008,2009,2010,2011,...,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024
0,Andalucia,7.490858e+06,7.596513e+06,7.730705e+06,7.865775e+06,7.986597e+06,8.118575e+06,8.212986e+06,8.276017e+06,8.332087e+06,...,8.399618e+06,8.403774e+06,8.408825e+06,8.410094e+06,8.427404e+06,8.478084e+06,8.502217e+06,8.519107e+06,8584147,8631862
1,Aragon,1.225563e+06,1.237793e+06,1.255078e+06,1.273568e+06,1.294246e+06,1.325426e+06,1.342778e+06,1.344184e+06,1.344396e+06,...,1.326403e+06,1.318571e+06,1.316040e+06,1.313135e+06,1.320586e+06,1.330333e+06,1.331133e+06,1.314159e+06,1341289,1351591
2,Asturias,1.062320e+06,1.062408e+06,1.062755e+06,1.063488e+06,1.065291e+06,1.071081e+06,1.076280e+06,1.077103e+06,1.075877e+06,...,1.049875e+06,1.040925e+06,1.034277e+06,1.027624e+06,1.022205e+06,1.018899e+06,1.012889e+06,1.006234e+06,1006060,1009599
3,Islas Baleares,8.834104e+05,9.129639e+05,9.401239e+05,9.702881e+05,1.005184e+06,1.042855e+06,1.070164e+06,1.083683e+06,1.091656e+06,...,1.124972e+06,1.135527e+06,1.150935e+06,1.166923e+06,1.188220e+06,1.210725e+06,1.219775e+06,1.223980e+06,1209906,1231768
4,Canarias,1.755693e+06,1.804255e+06,1.853155e+06,1.899609e+06,1.946071e+06,1.991945e+06,2.025486e+06,2.045168e+06,2.064876e+06,...,2.126144e+06,2.135209e+06,2.154924e+06,2.177048e+06,2.206901e+06,2.236992e+06,2.244369e+06,2.252237e+06,2213016,2238754

In [29]:
df_coste_vivienda.head()

,COMUNIDAD,2000,2001,2002,2003,2004,2005,2006,2007,2008,...,2016,2017,2018,2019,2020,2021,2022,2023,2024,2025
0,Andalucia,633.0,726.2,843.1,983.6,1179.7,1391.2,1587.4,1707.0,1800.2,...,1210.6,1227.9,1245.5,1303.7,1312.3,1303.1,1399.6,1466.3,1555.7,1698.2
1,Aragon,787.2,893.3,1017.3,1117.4,1311.6,1493.8,1741.8,1883.7,1962.9,...,1183.3,1165.0,1171.5,1206.4,1214.7,1180.6,1259.3,1273.6,1345.1,1494.6
2,Asturias,814.6,897.2,1004.0,1116.5,1281.7,1424.1,1563.7,1655.3,1775.9,...,1286.3,1263.8,1260.5,1274.7,1262.8,1283.6,1303.7,1335.6,1362.8,1518.8
3,Islas Baleares,1054.7,1247.5,1413.9,1531.1,1672.8,1890.2,2120.8,2311.7,2408.1,...,2054.7,2064.5,2208.4,2321.3,2379.2,2363.4,2611.1,2802.8,3034.3,3436.0
4,Canarias,914.4,1048.7,1129.6,1241.0,1375.4,1526.5,1657.8,1750.8,1833.3,...,1334.3,1386.7,1440.8,1512.5,1533.2,1498.6,1594.8,1670.3,1789.1,1965.7

In [30]:
df_censo_melted = pd.melt(df_censo, id_vars=['Comunidad'])

In [31]:
df_censo_melted.head(10)

              Comunidad variable         value
0             Andalucia     2003  7.490858e+06
1                Aragon     2003  1.225563e+06
2              Asturias     2003  1.062320e+06
3        Islas Baleares     2003  8.834104e+05
4              Canarias     2003  1.755693e+06
5             Cantabria     2003  5.416455e+05
6       Castilla y Leon     2003  2.463623e+06
7    Castilla La Mancha     2003  1.797142e+06
8             Catalunya     2003  6.556909e+06
9  Comunitat Valenciana     2003  4.322063e+06

In [32]:
df_coste_vivienda_melted = pd.melt(df_coste_vivienda, id_vars=['COMUNIDAD'])
df_coste_vivienda_melted.head(10)

              COMUNIDAD variable   value
0             Andalucia     2000   633.0
1                Aragon     2000   787.2
2              Asturias     2000   814.6
3        Islas Baleares     2000  1054.7
4              Canarias     2000   914.4
5             Cantabria     2000   879.8
6       Castilla y Leon     2000   766.8
7    Castilla La Mancha     2000   593.9
8             Catalunya     2000  1039.8
9  Comunitat Valenciana     2000   673.6

In [33]:
df_censo_melted["value"] = df_censo_melted["value"].astype(int)

In [34]:
df_censo_melted.head(10)

              Comunidad variable    value
0             Andalucia     2003  7490857
1                Aragon     2003  1225563
2              Asturias     2003  1062319
3        Islas Baleares     2003   883410
4              Canarias     2003  1755693
5             Cantabria     2003   541645
6       Castilla y Leon     2003  2463622
7    Castilla La Mancha     2003  1797142
8             Catalunya     2003  6556908
9  Comunitat Valenciana     2003  4322062

In [35]:
# Renombramos las columnas del df censo

df_censo_melted = df_censo_melted.rename(columns={
    "Comunidad": "comunidad",
    "variable": "anio",
    "value": "poblacion"
})

In [36]:
df_censo_melted.head(5)

        comunidad  anio  poblacion
0       Andalucia  2003    7490857
1          Aragon  2003    1225563
2        Asturias  2003    1062319
3  Islas Baleares  2003     883410
4        Canarias  2003    1755693

In [37]:
# Renombramos las columnas del df coste vivienda

df_coste_vivienda_melted = df_coste_vivienda_melted.rename(columns={
    "COMUNIDAD": "comunidad",
    "variable": "anio",
    "value": "coste_medio"
})

df_coste_vivienda_melted.head(5)

        comunidad  anio  coste_medio
0       Andalucia  2000        633.0
1          Aragon  2000        787.2
2        Asturias  2000        814.6
3  Islas Baleares  2000       1054.7
4        Canarias  2000        914.4

In [38]:
# Importamos datos de hipotecas a partir de un csv

# 1) Rutas del ficheros 

RUTA_BASE = r"C:/Users/Elías/Desktop/Bootcamp/Proyectos/Week 4"
RUTA_FICHERO   = rf"{RUTA_BASE}/Hipotecas_ipc.csv"

# 2) Cargar hipotecas

df_hipotecas_ipc = pd.read_csv(RUTA_FICHERO, low_memory=False, encoding="utf-8")

In [39]:
df_hipotecas_ipc.head(5)

,codigo_comunidad,comunidad,name,year,precio,IPC,edad_media,mano_obra,precio_Acero,precio_Aluminio,precio_Cemento,precio_Ceramica,precio_Cobre,precio_Energía,precio_Ligantes,precio_Madera,num_hipotecas,num_inmigracion
0,1,andalucia,Andalucía,2003-01-01,995.0,72.838,37.951542,313.00,719.9,725.8,1349.9,1227.4,558.2,2017.0,1453.9,1507.4,69821,205704
1,1,andalucia,Andalucía,2003-04-01,1033.0,74.225,37.951542,317.54,730.7,728.3,1343.7,1227.2,527.6,1940.9,1525.7,1507.2,57326,213822
2,1,andalucia,Andalucía,2003-07-01,1094.0,73.579,38.049990,315.92,724.4,704.8,1324.6,1226.0,541.2,1865.3,1517.8,1512.6,52571,221941
3,1,andalucia,Andalucía,2003-10-01,1133.0,74.736,38.049990,319.96,717.4,705.4,1331.2,1224.4,590.5,1817.3,1445.2,1512.9,63411,230060
4,1,andalucia,Andalucía,2004-01-01,1186.0,74.391,38.146028,319.41,735.7,711.7,1342.7,1226.0,689.3,1773.3,1262.8,1517.9,79923,238178

In [40]:
df_hipotecas = df_hipotecas_ipc[["comunidad", "year", "num_hipotecas"]].copy()

In [41]:
df_hipotecas.head(5)

   comunidad        year  num_hipotecas
0  andalucia  2003-01-01          69821
1  andalucia  2003-04-01          57326
2  andalucia  2003-07-01          52571
3  andalucia  2003-10-01          63411
4  andalucia  2004-01-01          79923

In [42]:
df_hipotecas = df_hipotecas.rename(columns={
    "year": "anio",
    "num_hipotecas": "n_hipotecas"
})

df_hipotecas.head(5)

   comunidad        anio  n_hipotecas
0  andalucia  2003-01-01        69821
1  andalucia  2003-04-01        57326
2  andalucia  2003-07-01        52571
3  andalucia  2003-10-01        63411
4  andalucia  2004-01-01        79923

In [43]:
# 2) Rutas a los ficheros 

RUTA_BASE = r"C:/Users/Elías/Desktop/Bootcamp/Proyectos/Week 4"
RUTA_SALARIOS   = rf"{RUTA_BASE}/Salarios.xls"


# 3) Cargar excel

df_salarios = pd.read_excel(RUTA_SALARIOS, engine="xlrd") 

df_salarios.head(5)

   comunidad  anio  salario_mediana
0  Andalucia  2023            20864
1  Andalucia  2022            19884
2  Andalucia  2021            19522
3  Andalucia  2020            18767
4  Andalucia  2019            18672

In [44]:
df_hipotecas["anio"] = pd.to_datetime(df_hipotecas["anio"])
df_hipotecas = df_hipotecas[df_hipotecas["anio"].dt.month == 1]

In [45]:
map_df_hipotecas = {
    'andalucia': 'Andalucia',
    'aragon': 'Aragon',
    'cantabria': 'Cantabria',
    'castilla-leon' : 'Castilla y Leon',
    'castilla-mancha': 'Castilla La Mancha',
    'catalunya': 'Catalunya',
    'ceuta': 'Ceuta',
    'comunidad-foral-navarra': 'Navarra',
    'comunidad-madrid': 'Madrid',
    'comunitat-valenciana': 'Comunitat Valenciana',
    'extremadura': 'Extremadura',
    'galicia': 'Galicia',
    'islas-baleares': 'Islas Baleares',
    'Canarias': 'Canarias',
    'la-rioja': 'La Rioja',
    'pais-vasco': 'Pais Vasco',
    'region-murcia': 'Murcia',
    'principado-asturias': 'Asturias',
    'melilla': 'Melilla'
}
df_hipotecas["comunidad"] = df_hipotecas["comunidad"].replace(map_df_hipotecas) 

df_hipotecas.head(5)

    comunidad       anio  n_hipotecas
0   Andalucia 2003-01-01        69821
4   Andalucia 2004-01-01        79923
8   Andalucia 2005-01-01        87061
12  Andalucia 2006-01-01       104818
16  Andalucia 2007-01-01       102189

In [46]:
df_hipotecas['anio'] = pd.to_datetime(df_hipotecas['anio'], errors='coerce').dt.year

In [47]:
df_hipotecas['anio'] = pd.to_numeric(df_hipotecas['anio'], errors='coerce')

In [48]:
df_hipotecas.head(5)

    comunidad  anio  n_hipotecas
0   Andalucia  2003        69821
4   Andalucia  2004        79923
8   Andalucia  2005        87061
12  Andalucia  2006       104818
16  Andalucia  2007       102189

In [49]:
df_censo_melted.to_csv(r"C:/Users/Elías/Desktop/Bootcamp/Proyectos/Week 4/CSV/censo.csv", index=False, encoding="utf-8")
df_coste_vivienda_melted.to_csv(r"C:/Users/Elías/Desktop/Bootcamp/Proyectos/Week 4/CSV/coste_vivienda.csv", index=False, encoding="utf-8")
df_hipotecas.to_csv(r"C:/Users/Elías/Desktop/Bootcamp/Proyectos/Week 4/CSV/hipotecas.csv", index=False, encoding="utf-8")
df_salarios.to_csv(r"C:/Users/Elías/Desktop/Bootcamp/Proyectos/Week 4/CSV/salarios.csv", index=False, encoding="utf-8")